# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
a = int(input("Введите трехзначное число: "))
sum1 = a % 10
sum2 = a % 100 // 10
sum3 = a // 100

print(sum1 + sum2 + sum3)