# 3. Четырехзначное?
# Пользователь вводит целое число. Выведите YES, если это число является четырехзначным, и NO в противном случае.

a = input("Введите число: ")
if len(a) == 4:
    print("YES")
else:
    print("NO")


